hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_adc.c
/**
 *******************************************************************************
 * @file  hc32f120_adc.c
 * @brief This file provides firmware functions to manage the Analog-to-Digital
 *        Converter(ADC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-03-18       Wuze            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f120_adc.h"
#include "hc32f120_utility.h"

/**
 * @addtogroup HC32F120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_ADC ADC
 * @brief Analog-to-Digital Converter Driver Library
 * @{
 */

#if (DDL_ADC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ADC_Local_Macros ADC Local Macros
 * @{
 */

/**
 * @brief Definitions of ADC trigger event registers.
 */
#define ADC_TRG_EVT0_REG                    M0P_AOS->ADC_ITRGSELR0
#define ADC_TRG_EVT1_REG                    M0P_AOS->ADC_ITRGSELR1

/**
 * @defgroup ADC_Check_Parameters_Validity ADC check parameters validity
 * @{
 */
#define IS_ADC_SCAN_CONV_MODE(x)                                               \
(   ((x) == ADC_MODE_SA_SINGLE)             ||                                 \
    ((x) == ADC_MODE_SA_CONTINUOUS)         ||                                 \
    ((x) == ADC_MODE_SA_SB_SINGLE)          ||                                 \
    ((x) == ADC_MODE_SA_CONTINUOUS_SB_SINGLE))

#define IS_ADC_RESOLUTION(x)                                                   \
(   ((x) == ADC_RESOLUTION_8B)              ||                                 \
    ((x) == ADC_RESOLUTION_10B)             ||                                 \
    ((x) == ADC_RESOLUTION_12B))

#define IS_ADC_AUTO_CLEAR_CMD(x)                                               \
(   ((x) == ADC_AUTO_CLR_DISABLE)           ||                                 \
    ((x) == ADC_AUTO_CLR_ENABLE))

#define IS_ADC_DATA_ALIGN(x)                                                   \
(   ((x) == ADC_DATA_ALIGN_RIGHT)           ||                                 \
    ((x) == ADC_DATA_ALIGN_LEFT))

#define IS_ADC_SA_RESTART_FROM(x)                                              \
(   ((x) == ADC_SA_RESTRT_FROM_INT_CH)      ||                                 \
    ((x) == ADC_SA_RESTRT_FROM_FIRST_CH))

#define IS_ADC_PIN_NUMBER(x)                                                   \
(   ((x) == ADC_ANI0)                       ||                                 \
    (((x) >= ADC_ANI1) && ((x) <= ADC_ANI11)))

#define IS_ADC_SEQUENCE(x)                                                     \
(   ((x) == ADC_SEQ_A)                      ||                                 \
    ((x) == ADC_SEQ_B))

#define IS_ADC_SAMPLE_TIME(x)                                                  \
(   ((x) >= 5u))

#define IS_ADC_TRIGGER_SRC(x)                                                  \
(   ((x) == ADC_TRGSRC_EX_PIN)              ||                                 \
    ((x) == ADC_TRGSRC_IN_EVT0)             ||                                 \
    ((x) == ADC_TRGSRC_IN_EVT1)             ||                                 \
    ((x) == ADC_TRGSRC_IN_EVT0_EVT1))

#define IS_ADC_EX_CH(x)                                                        \
(   ((x) == ADC_EX_CH_SEL_ANI11)            ||                                 \
    ((x) == ADC_EX_CH_SEL_INTERNAL))


