hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_adc.c
#define IS_AWD_CMP_MODE(x)                                                     \
(   ((x) == ADC_AWD_CMP_OUT_RANGE)          ||                                 \
    ((x) == ADC_AWD_CMP_IN_RANGE))

#define IS_AWD_COMB_MODE(x)                                                    \
(   ((x) == ADC_AWD_COMB_INVALID)           ||                                 \
    ((x) == ADC_AWD_COMB_OR)                ||                                 \
    ((x) == ADC_AWD_COMB_AND)               ||                                 \
    ((x) == ADC_AWD_COMB_XOR))

#define IS_ADC_SA_TRIGGER_EVT(x)                                               \
(   ((x) == EVT_PORT_EIRQ0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ8)                 ||                                 \
    (((x) >= EVT_TMRB_7_OVF) && ((x) <= EVT_TMRB_8_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ1)                 ||                                 \
    ((x) == EVT_PORT_EIRQ9)                 ||                                 \
    (((x) >= EVT_TMRB_8_OVF) && ((x) <= EVT_TMRB_7_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ2)                 ||                                 \
    (((x) >= EVT_TMRB_5_OVF) && ((x) <= EVT_TMRB_6_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ3)                 ||                                 \
    ((x) == EVT_TMR0_GCMP)                  ||                                 \
    (((x) >= EVT_TMRB_6_OVF) && ((x) <= EVT_AOS_STRG))      ||                 \
    ((x) == EVT_PORT_EIRQ4)                 ||                                 \
    (((x) >= EVT_TMRB_3_OVF) && ((x) <= EVT_TMRB_4_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ5)                 ||                                 \
    (((x) >= EVT_TMRB_4_OVF) && ((x) <= EVT_TMRB_3_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ6)                 ||                                 \
    (((x) >= EVT_TMRB_1_OVF) && ((x) <= EVT_TMRB_2_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ7)                 ||                                 \
    (((x) >= EVT_FMC_OPTEND) && ((x) <= EVT_RTC_PRD))       ||                 \
    (((x) >= EVT_TMRB_2_OVF) && ((x) <= EVT_TMRB_1_CMP)))

#define IS_ADC_SB_TRIGGER_EVT(x)                                               \
(   ((x) == EVT_PORT_EIRQ0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ8)                 ||                                 \
    (((x) >= EVT_TMRB_7_OVF) && ((x) <= EVT_TMRB_8_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ1)                 ||                                 \
    ((x) == EVT_PORT_EIRQ9)                 ||                                 \
    (((x) >= EVT_TMRB_8_OVF) && ((x) <= EVT_TMRB_7_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ2)                 ||                                 \
    (((x) >= EVT_TMRB_5_OVF) && ((x) <= EVT_TMRB_6_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ3)                 ||                                 \
    ((x) == EVT_TMR0_GCMP)                  ||                                 \
    (((x) >= EVT_TMRB_6_OVF) && ((x) <= EVT_AOS_STRG))      ||                 \
    ((x) == EVT_PORT_EIRQ4)                 ||                                 \
    (((x) >= EVT_TMRB_3_OVF) && ((x) <= EVT_ADC_EOCA))      ||                 \
    ((x) == EVT_PORT_EIRQ5)                 ||                                 \
    (((x) >= EVT_TMRB_4_OVF) && ((x) <= EVT_ADC_EOCB))      ||                 \
    ((x) == EVT_PORT_EIRQ6)                 ||                                 \
    (((x) >= EVT_TMRB_1_OVF) && ((x) <= EVT_TMRB_2_CMP))    ||                 \
    ((x) == EVT_PORT_EIRQ7)                 ||                                 \
    (((x) >= EVT_FMC_OPTEND) && ((x) <= EVT_RTC_PRD))       ||                 \
    (((x) >= EVT_TMRB_2_OVF) && ((x) <= EVT_TMRB_1_CMP)))

#define IS_AWD_PIN_NUMBER(x)                                                   \
(   ((x) == ADC_ANI0)                       ||                                 \
    (((x) >= ADC_ANI1) && ((x) <= ADC_ANI11)))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ADC_Global_Functions ADC Global Functions
 * @{
 */

/**
 * @brief  Initializes the ADC peripheral according to the specified parameters
 *         in the structure stc_adc_init.
 * @param  [in]  pstcInit           Pointer to a stc_adc_init_t structure value that
 *                                  contains the configuration information for the ADC.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcInit == NULL.
 */
en_result_t ADC_Init(const stc_adc_init_t *pstcInit)
{
    if (pstcInit == NULL)
    {
        return ErrorInvalidParameter;
    }

    DDL_ASSERT(IS_ADC_SCAN_CONV_MODE(pstcInit->u16ScanConvMode));
    DDL_ASSERT(IS_ADC_RESOLUTION(pstcInit->u16Resolution));
    DDL_ASSERT(IS_ADC_AUTO_CLEAR_CMD(pstcInit->u16AutoClearCmd));
    DDL_ASSERT(IS_ADC_DATA_ALIGN(pstcInit->u16DataAlign));
    DDL_ASSERT(IS_ADC_SA_RESTART_FROM(pstcInit->u16RestrtFrom));

