hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_adc.c
    ADC_DeInit();

    /* Configures scan convert mode, resolution, data automatically cleared cmd
       and data alignment. */
    M0P_ADC->CR0 = pstcInit->u16ScanConvMode  |   \
                   pstcInit->u16Resolution    |   \
                   pstcInit->u16AutoClearCmd  |   \
                   pstcInit->u16DataAlign;

    /* Configures sampling time. */
    M0P_ADC->SSTR = pstcInit->u8SampTime;

    /* Configures the channel sequence A restart from. */
    M0P_ADC->CR1  = pstcInit->u16RestrtFrom;

    return Ok;
}

/**
 * @brief  De-initializes the ADC peripheral.
 * @param  None
 * @retval None
 */
void ADC_DeInit(void)
{
    /* Stop the ADC. */
    ADC_Stop();

    /* Configures the registers to default value. */
    M0P_ADC->TRGSR    = 0x0u;
    M0P_ADC->CHSELRA0 = 0x0u;
    M0P_ADC->CHSELRB0 = 0x0u;
    M0P_ADC->EXCHSELR = 0x0u;
    M0P_ADC->ISR      = 0x0u;
    M0P_ADC->ICR      = 0x0u;
    M0P_ADC->AWDCR    = 0x0u;
    M0P_ADC->AWDSR    = 0x0u;
}

/**
 * @brief  Set a default value for the ADC initialization structure.
 * @param  [in]  pstcInit           Pointer to a stc_adc_init_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcInit == NULL.
 */
en_result_t ADC_StructInit(stc_adc_init_t *pstcInit)
{
    if (pstcInit == NULL)
    {
        return ErrorInvalidParameter;
    }

    pstcInit->u16ScanConvMode = ADC_MODE_SA_SINGLE;
    pstcInit->u16Resolution   = ADC_RESOLUTION_10B;
    pstcInit->u16AutoClearCmd = ADC_AUTO_CLR_DISABLE;
    pstcInit->u16DataAlign    = ADC_DATA_ALIGN_RIGHT;
    pstcInit->u8SampTime      = 20;
    pstcInit->u16RestrtFrom   = ADC_SA_RESTRT_FROM_INT_CH;

    return Ok;
}

/**
 * @brief  ADC add ADC channel(s).
 * @param  [in]  u8Seq              The specified sequence for the channel(s) to be added in.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A:               Add channels to sequence A.
 *   @arg  ADC_SEQ_B:               Add channels to sequence B.
 * @param  [in]  u16Channel         The specified channel(s) to be added in the specified sequence.
 *                                  This parameter can be values of @ref ADC_Channels
 *   @arg  ADC_CH0 ~ ADC_CH11
 * @retval None.
 * @note  -(1) ADC must be stoped.
 *        -(2) Sequence A and Sequence B cannot contain the same channel.
 */
void ADC_AddAdcChannel(uint8_t u8Seq, uint16_t u16Channel)
{
    uint16_t u16Ch;

    u16Ch = u16Channel & ADC_CH_ALL;

    /* Configures the channels. */
    if (u8Seq == ADC_SEQ_A)
    {
        M0P_ADC->CHSELRA0 |= u16Ch;
    }
    else
    {
        M0P_ADC->CHSELRB0 |= u16Ch;
    }
}

/**
 * @brief  ADC set extend channel.
 * @param  [in]  u8ExCh             The specified source for the extend channel(channel 11).
 *                                  This parameter can be a value of @ref ADC_Extend_Channel_Source_Selection
 *   @arg  ADC_EX_CH_SEL_ANI11:     Select the pin ANI11 as the extend channel analog input source.
 *   @arg  ADC_EX_CH_SEL_INTERNAL:  Select the internal analog source as the extend channel analog input source.
 * @retval None.
 * @note   ADC must be stoped.
 */
void ADC_SetExChannel(uint8_t u8ExCh)
{
    DDL_ASSERT(IS_ADC_EX_CH(u8ExCh));
    M0P_ADC->EXCHSELR = u8ExCh;
}

/**
 * @brief  Configures ADC's trigger source.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  pstcTrgCfg         Pointer to a stc_adc_trg_cfg_t structure that contains
 *                                  the configuration information of the trigger source.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcTrgCfg == NULL.
 * @note   ADC must be stoped.
 */
en_result_t ADC_ConfigTriggerSrc(uint8_t u8Seq, const stc_adc_trg_cfg_t *pstcTrgCfg)
{
    uint8_t u8Offset;

    if (pstcTrgCfg == NULL)
    {
        return ErrorInvalidParameter;
    }

    DDL_ASSERT(IS_ADC_TRIGGER_SRC(pstcTrgCfg->u16TrgSrc));

    /* Disable the specified sequence's trigger source. */
    ADC_TriggerSrcCmd(u8Seq, Disable);

    if (u8Seq == ADC_SEQ_A)
    {
        u8Offset = 0u;
        DDL_ASSERT(IS_ADC_SA_TRIGGER_EVT(pstcTrgCfg->u32Event0));
        DDL_ASSERT(IS_ADC_SA_TRIGGER_EVT(pstcTrgCfg->u32Event1));
    }
    else
    {
        u8Offset = 8u;
        DDL_ASSERT(IS_ADC_SB_TRIGGER_EVT(pstcTrgCfg->u32Event0));
        DDL_ASSERT(IS_ADC_SB_TRIGGER_EVT(pstcTrgCfg->u32Event1));
    }

    switch (pstcTrgCfg->u16TrgSrc)
    {
        case ADC_TRGSRC_IN_EVT0:
            ADC_TRG_EVT0_REG = pstcTrgCfg->u32Event0;
            break;

        case ADC_TRGSRC_IN_EVT1:
            ADC_TRG_EVT1_REG = pstcTrgCfg->u32Event1;
            break;

        case ADC_TRGSRC_IN_EVT0_EVT1:
            ADC_TRG_EVT0_REG = pstcTrgCfg->u32Event0;
            ADC_TRG_EVT1_REG = pstcTrgCfg->u32Event1;
            break;

        default:
            break;
    }

    M0P_ADC->TRGSR &= ~(ADC_TRGSRC_MASK << u8Offset);
    M0P_ADC->TRGSR |= pstcTrgCfg->u16TrgSrc << u8Offset;

    return Ok;
}

/**
 * @brief  Set a default value for the trigger source configuration structure.
 * @param  [in]  pstcTrgCfg         Pointer to a stc_adc_trg_cfg_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcTrgCfg == NULL.
 */
en_result_t ADC_TriggerSrcStructInit(stc_adc_trg_cfg_t *pstcTrgCfg)
{
    if (pstcTrgCfg == NULL)
    {
        return ErrorInvalidParameter;
    }

    pstcTrgCfg->u16TrgSrc = ADC_TRGSRC_IN_EVT0;
    pstcTrgCfg->u32Event0 = EVT_AOS_STRG;
    pstcTrgCfg->u32Event1 = EVT_AOS_STRG;

    return Ok;
}

/**
 * @brief  Enable or disable the trigger source of the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the trigger source of the specified sequence.
 *   @arg  Disable:                 Disable the trigger source of the specified sequence.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_TriggerSrcCmd(uint8_t u8Seq, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

