hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_adc.c
    if (u8Seq == ADC_SEQ_A)
    {
        bM0P_ADC->TRGSR_b.TRGENA = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->TRGSR_b.TRGENB = (uint32_t)enNewState;
    }
}

/**
 * @brief  Enable or disable the interrupt of the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the interrupt of the specified sequence.
 *   @arg  Disable:                 Disable the interrupt of the specified sequence.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AdcIntCmd(uint8_t u8Seq, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8Seq == ADC_SEQ_A)
    {
        bM0P_ADC->ICR_b.EOCAIEN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->ICR_b.EOCBIEN = (uint32_t)enNewState;
    }
}

/**
 * @brief  Gets the EOC(End Of Conversion) flag.
 * @param  [in]  u8Flag         ADC EOC flag.
 *                              This parameter can be a value of @ref ADC_Eoc_Flag
 *   @arg  ADC_FLAG_EOCA
 *   @arg  ADC_FLAG_EOCB
 * @retval An en_flag_status_t enumeration.
 *   @arg  Set: The specified flag has set.
 *   @arg  Reset: The specified flag has not set.
 */
en_flag_status_t ADC_GetEocFlag(uint8_t u8Flag)
{
    return (en_flag_status_t)((M0P_ADC->ISR & u8Flag) != 0u);
}

/**
 * @brief  Clear the EOC(End Of Conversion) flag.
 * @param  [in]  u8Flag             An 8bit data that containing EOCA(End Of Conversion of Sequence A)
 *                                  flag and EOCB flag. This parameter can be values of @ref ADC_Eoc_Flag
 *   @arg  ADC_FLAG_EOCA
 *   @arg  ADC_FLAG_EOCB
 * @retval None
 */
void ADC_ClrEocFlag(uint8_t u8Flag)
{
    u8Flag &= ADC_FLAG_EOC_ALL;
    M0P_ADC->ISCLRR |= u8Flag;
}

/**
 * @brief  Starts ADC conversion of sequence A.
 * @param  [in]  pu16Dest           Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u32Timeout         Timeout value(millisecond).
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pu16Dest == NULL or u32Timeout == 0.
 *   @arg  ErrorTimeout:            ADC works timeout.
 */
en_result_t ADC_SaPolling(uint16_t *pu16Dest, uint32_t u32Timeout)
{
    en_result_t   enRet;
    uint32_t      u32AdcTimeout;
    __IO uint32_t u32TimeCount;

    if ((pu16Dest == NULL) || (u32Timeout == 0u))
    {
        return ErrorInvalidParameter;
    }

    /* 10 is the number of required instructions cycles for the below loop statement. */
    u32AdcTimeout = u32Timeout * (SystemCoreClock / 10u / 1000u);

    ADC_Start();

    /* Polling and check timeout. */
    u32TimeCount = 0u;
    enRet = ErrorTimeout;
    while (u32TimeCount < u32AdcTimeout)
    {
        if (bM0P_ADC->ISR_b.EOCAF != 0u)
        {
            enRet = Ok;
            break;
        }
        u32TimeCount++;
    }

    if (enRet == Ok)
    {
        ADC_GetSeqData(ADC_SEQ_A, pu16Dest);
    }

    bM0P_ADC->ISCLRR_b.CLREOCAF = 1u;

    return enRet;
}

/**
 * @brief  Get the ADC data of the specified sequence.
 * @param  [in]  u8Seq              The specified sequence.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [out] pu16Dest           Pointer to the buffer the ADC data to be stored.
 * @retval None
 */
void ADC_GetSeqData(uint8_t u8Seq, uint16_t *pu16Dest)
{
    uint16_t u16Channel;

    if (u8Seq == ADC_SEQ_A)
    {
        u16Channel = M0P_ADC->CHSELRA0;
    }
    else
    {
        u16Channel = M0P_ADC->CHSELRB0;
    }

    ADC_GetChannelData(u16Channel, pu16Dest);
}

/**
 * @brief  Get the ADC data of the specified channel(s).
 * @param  [in]  u16Channel         The specified Channel(s).
 *                                  This parameter can be values of @ref ADC_Channels
 *   @arg  ADC_CH0 ~ ADC_CH11
 * @param  [out] pu16Dest           Pointer to the buffer the ADC data to be stored.
 * @retval None
 */
void ADC_GetChannelData(uint16_t u16Channel, uint16_t *pu16Dest)
{
    uint8_t i;
    uint8_t j;
    __IO uint16_t *io16AdcDr = NULL;

    if ((u16Channel == 0u) || (pu16Dest == NULL))
    {
        return;
    }

    i = 0u;
    j = 0u;
    io16AdcDr = &M0P_ADC->DR0;
    u16Channel &= ADC_CH_ALL;
    while (u16Channel)
    {
        if (u16Channel & 0x1u)
        {
            pu16Dest[j++] = io16AdcDr[i];
        }

        u16Channel >>= 1u;
        i++;
    }
}

/**
 * @brief  Configures an AWD's comparison mode.
 * @param  [in]  u8AwdNbr           The specified AWD to be configured.
 *                                  This parameter can be a value of @ref ADC_AWD_Number
 *   @arg  ADC_AWD_0
 *   @arg  ADC_AWD_1
 * @param  [in]  pstcAwdCfg         Pointer to a stc_awd_cfg_t structure that contains
 *                                  the configuration information for the AWD.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcAwdCfg == NULL.
 * @note   ADC must be stoped.
 */
en_result_t ADC_AwdConfig(uint8_t u8AwdNbr, const stc_awd_cfg_t *pstcAwdCfg)
{
    if (pstcAwdCfg == NULL)
    {
        return ErrorInvalidParameter;
    }

    DDL_ASSERT(IS_AWD_PIN_NUMBER(pstcAwdCfg->u8AdcPin));
    DDL_ASSERT(IS_AWD_CMP_MODE(pstcAwdCfg->u16AwdMd));

    /* Disable AWDx. */
    ADC_AwdCmd(u8AwdNbr, Disable);

    /* Disable combination mode. */
    M0P_ADC->AWDCR &= ~ADC_AWD_COMB_MASK;

    if (u8AwdNbr == ADC_AWD_0)
    {
        bM0P_ADC->AWDCR_b.AWD0MD = (uint32_t)pstcAwdCfg->u16AwdMd;
        M0P_ADC->AWD0DR0  = pstcAwdCfg->u16Dr0;
        M0P_ADC->AWD0DR1  = pstcAwdCfg->u16Dr1;
        M0P_ADC->AWD0CHSR = pstcAwdCfg->u8AdcPin;
    }
    else
    {
        bM0P_ADC->AWDCR_b.AWD1MD = (uint32_t)pstcAwdCfg->u16AwdMd;
        M0P_ADC->AWD1DR0  = pstcAwdCfg->u16Dr0;
        M0P_ADC->AWD1DR1  = pstcAwdCfg->u16Dr1;
        M0P_ADC->AWD1CHSR = pstcAwdCfg->u8AdcPin;
    }

    return Ok;
}

/**
 * @brief  Enable or Disable an AWD.
 * @param  [in]  u8AwdNbr           The specified AWD to be configured.
 *                                  This parameter can be a value of @ref ADC_AWD_Number
 *   @arg  ADC_AWD_0
 *   @arg  ADC_AWD_1
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the specified AWD.
 *   @arg  Disable:                 Disable the specified AWD.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AwdCmd(uint8_t u8AwdNbr, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

