hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_adc.c
    if (u8AwdNbr == ADC_AWD_0)
    {
        bM0P_ADC->AWDCR_b.AWD0EN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->AWDCR_b.AWD1EN = (uint32_t)enNewState;
    }
}

/**
 * @brief  Enable or Disable an AWD's interrupt.
 * @param  [in]  u8AwdNbr           The specified AWD to be configured.
 *                                  This parameter can be a value of @ref ADC_AWD_Number
 *   @arg  ADC_AWD_0
 *   @arg  ADC_AWD_1
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the interrupt of the specified AWD.
 *   @arg  Disable:                 Disable the interrupt of the specified AWD.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AwdIntCmd(uint8_t u8AwdNbr, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8AwdNbr == ADC_AWD_0)
    {
        bM0P_ADC->AWDCR_b.AWD0IEN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->AWDCR_b.AWD1IEN = (uint32_t)enNewState;
    }
}

/**
 * @brief  Configures the combined mode of the AWD.
 * @param  [in]  u16ComMd           This parameter can be a value of @ref ADC_AWD_Combination_Mode
 *   @arg  ADC_AWD_COMB_INVALID:    Analog watchdog combination mode is invalid.
 *   @arg  ADC_AWD_COMB_OR:         AWD result of combination will be AWD0 | AWD1.
 *   @arg  ADC_AWD_COMB_AND:        AWD result of combination will be AWD0 & AWD1.
 *   @arg  ADC_AWD_COMB_XOR:        AWD result of combination will be AWD0 ^ AWD1.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AwdConfigCombMode(uint16_t u16ComMd)
{
    DDL_ASSERT(IS_AWD_COMB_MODE(u16ComMd));

    M0P_ADC->AWDCR &= ~ADC_AWD_COMB_MASK;
    M0P_ADC->AWDCR |= u16ComMd;
}

/**
 * @brief  Gets the AWD state flag.
 * @param  [in]  u8Flag         AWD state flag.
 *                              This parameter can be a value of @ref ADC_AWD_State_Flag
 *   @arg  ADC_FLAG_AWD0
 *   @arg  ADC_FLAG_AWD1
 *   @arg  ADC_FLAG_AWD_COMB
 * @retval An en_flag_status_t enumeration.
 *   @arg  Set: The specified flag has set.
 *   @arg  Reset: The specified flag has not set.
 */
en_flag_status_t ADC_AwdGetFlag(uint8_t u8Flag)
{
    return (en_flag_status_t)((M0P_ADC->AWDSR & u8Flag) != 0u);
}

/**
 * @brief  ADC clear AWD state flag.
 * @param  [in]  u8Flag             An 8bit data that containing AWD0, AWD1 and combination flag.
 *                                  This parameter can be values of @ref ADC_AWD_State_Flag
 *   @arg  ADC_FLAG_AWD0
 *   @arg  ADC_FLAG_AWD1
 *   @arg  ADC_FLAG_AWD_COMB
 *   @arg  ADC_FLAG_AWD_ALL
 * @retval None
 */
void ADC_AwdClrFlag(uint8_t u8Flag)
{
    u8Flag &= ADC_FLAG_AWD_ALL;
    M0P_ADC->AWDSCLRR |= u8Flag;
}

/**
 * @}
 */

#endif /* DDL_ADC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
